shockTube/0/rho
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.2.2                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version 2.0;
	class volScalarField;
	object rho;
	format ascii;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 1 -1 0 0 0 0];
internalField   nonuniform List<scalar>
100
(
0.997517537954
0.997517537954
0.997517537954
0.997517537954
0.997517537954
0.997517537954
0.997517537954
0.997517537954
...
)
;
boundaryField
{
	walls
	{
		type zeroGradient;
	}
	sides
	{
		type zeroGradient;
	}
}
